<a href="https://colab.research.google.com/github/Jungddaseul/Big-Data-Certification-study-/blob/main/T1_1_%EC%9D%B4%EC%83%81%EC%B9%98%EB%A5%BC_%EC%B0%BE%EC%95%84%EB%9D%BC(IQR%ED%99%9C%EC%9A%A9).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

## 이상치를 찾아라
### 데이터에서 IQR을 활용해 Fare컬럼의 이상치를 찾고, 이상치 데이터의 여성 수를 구하시오
- 강의 영상 : https://youtu.be/ipBW5D_UJEo
- 데이터셋 : titanic 
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작
- 데이터 위치 "../input/titanic/train.csv" (copy&edit가 아닐 경우 별도로 데이터셋 불러와야 함)

[작업순서]
1. 라이브러리 및 데이터 불러오기
2. EDA작업(데이터 결측값, shape확인)
3. IQR 구하기
4. 최소값 = Q1 - 1.5*(Q3-Q1)
5. 최대값 = Q3 + 1.5*(Q3-Q1)
6. Fare 이상치 찾기
7. 이상치 데이터 여성수를 구하시오

In [3]:
# 라이브러리 및 데이터 불러오기
import pandas as pd
import numpy as np

df = pd.read_csv('/content/drive/MyDrive/빅분기/titanic/train.csv')

In [6]:
# EDA 작업
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
print(df.shape)
print(df.isnull().sum())

(891, 12)
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [18]:
# 구하고자 하는값 'Sex', 'Fare'은 결측치가 없으므로 전처리 없이 진행
# IQR 구하기
# Q1 : 1사분위, Q3 : 3사분위
# 최소값 = Q1 - 1.5(Q3-Q1), 최대값 = Q3 = 1.5(Q3-Q1)

Q3 = np.percentile(df['Fare'], 75)
Q1 = np.percentile(df['Fare'], 25)

IQR = Q3 - Q1
# Fare의 이상치 찾기
outdata1 = df[df['Fare'] < Q1 - 1.5*IQR]
outdata2 = df[df['Fare'] > Q3 + 1.5*IQR]

In [19]:
len(outdata1), len(outdata2)

(0, 116)

In [21]:
print(sum(outdata2['Sex'] == 'female'))

70